menu_msg = {
            'greetings': 'Привет! Я умею рисовать простые и сложные фигуры\n'
                         'Ты можешь создавать любые многоугольники, окружности и звезды\n'
                         'Контролировать толщину пера, его цвет, скорость отрисовки и количество фигур на холсте\n'
                         'А еще ты можешь выбрать любой цвет холста и время действия экрана!\n',


            'screen_size':'Для начала выберем размер рабочего пространства\n',

            'index_figure':'Теперь выберем фигуру:'
                           'Для выбора звезд введи - 1\n'
                           'Для выбора окружностей введи - 2\n'
                           'Для выбора многоугольников введи - 3\n'

            }


err_msg = {
            'err_screen_size': 'Размеры окна превышают разрешение экрана. Пожалуйста, введи меньшие значения.',
            'err_figure_index': 'Я пока не знаю такой фигуры, выберите из предложенных',
            'err_length': 'Слишком большая длинна стороны, фигура не поместится на холсте',
            'err_count_angles': 'Слишком большое количество углов, фигура не сможет быть отрисована'
          }

request_data = {
                'length': 'Укажите длину стороны фигуры',
                'count_angles': 'Укажите количество углов'
}




















input_length = 'Введите длину стороны'

input_corner = 'Укажите радиус угла, например 90, 45 и так далее'

err_input_star = 'Я могу построить звезду только с нечетным количеством концов'


main_menu = 'Привет! Я умею рисовать простые и сложные фигуры\nС чего начнем?'

