output_msg = {'greetings': """Привет! Я умею рисовать простые и сложные фигуры
Ты можешь создавать любые многоугольники, окружности и звезды
Контролировать толщину пера, его цвет, скорость отрисовки и количество фигур на холсте
А еще ты можешь выбрать любой цвет холста и время действия экрана!\n""",

            'screen_size':'Давайте выберем размер рабочего пространства\n',

            'main_menu':'Для выбора звезд введи - 1\n'
                        'Для выбора окружностей введи - 2\n'
                        'Для выбора многоугольников введи - 3\n'
              }























input_length = 'Введите длину стороны'

input_corner = 'Укажите радиус угла, например 90, 45 и так далее'

err_input_star = 'Я могу построить звезду только с нечетным количеством концов'


main_menu = 'Привет! Я умею рисовать простые и сложные фигуры\nС чего начнем?'

